import { ITimelineData } from "./interfaces"

export const timelineData: ITimelineData = {
  timelineTitile: "Исторические даты",
  periods: [
    {
      periodStart: 1987,
      periodEnd: 1991,
      periodName: "Кино",
      events: [
        {
          milestone: 1987,
          description: "\"Хищник/Predator\", США (реж. Джон Мактирнан)"
        },
        {
          milestone: 1988,
          description: "\"Кто подставил кролика роджера / Who Framed Roger Rabbit\", США (реж. Роберт Земекис)"
        },
        {
          milestone: 1988,
          description: "\"Бэтмэн\", реж. Тима Бёртон возродил интерес к супергеройским фильмам и стал кассовым хитом."
        },
        {
          milestone: 1990,
          description: "\"Крестный отец: Часть III\", фильм, завершивший трилогию Фрэнсиса Форда Копполы о мафии."
        },
        {
          milestone: 1991,
          description: "\"Молчание ягнят\", культовый триллер, получивший пять премий \"Оскар\""
        },
      ]
    },
    {
      periodStart: 1992,
      periodEnd: 1997,
      periodName: "Литература",
      events: [
        {
          milestone: 1992,
          description: "Нобелевская премия по литературе - Дерек Уолкотт, \"За блестящий образец карибского эпоса в 64 разделах\"."
        },
        {
          milestone: 1994,
          description: "\"Бессонница\" - роман Стивена Кинга."
        },
        {
          milestone: 1995,
          description: "Нобелевская премия по литературе - Шеймас Хини"
        },
        {
          milestone: 1997,
          description: "\"Гарри Поттер и философский камень\" - Джоанн Роулинг"
        },
      ]
    },
    {
      periodStart: 1994,
      periodEnd: 2004,
      periodName: "Театр",
      events: [
        {
          milestone: 1999,
          description: "Премьера балета \"Золушка\" в постановке Жан-Кристофа Майо, сценография Эрнеста Пиньона."
        },
        {
          milestone: 2000,
          description: "Возобновлено издание журнала \"Театр\""
        },
        {
          milestone: 2001,
          description: "Мюзикл \"Мамма Миа!\", премьера на Вэст-Энде в Лондоне, ставшая международным хитом"
        },
        {
          milestone: 2002,
          description: "Премьера трилогии Тома Стоппарда \"Берег Утопии\", Королевский Национальный театр, Лондон."
        },
        {
          milestone: 2004,
          description: "Премьера мюзикла \"В поисках счастья\" на Бродвее",
        },
      ]
    },
    {
      periodStart: 2015,
      periodEnd: 2022,
      periodName: "Наука",
      events: [
        {
          milestone: 2015,
          description: "Открытие гравитационных волн, предсказанных Альбертом Эйнштейном, коллаборацией LIGO."
        },
        {
          milestone: 2016,
          description: "Ученые из MIT разработали \"умные\" бактерии, которые могут взаимодействовать с окружающей средой и выполнять заданные функции."
        },
        {
          milestone: 2017,
          description: "Появление первой фотографии черной дыры, сделанной с помощью телескопа \"Event Horizon Telescope\"."
        },
        {
          milestone: 2018,
          description: "Успешное редактирование генома человека с помощью технологии CRISPR-Cas9."
        },
        {
          milestone: 2019,
          description: "Обнаружение воды на Луне с помощью данных, собранных миссией \"Лунный орбитальный зонд\" (LRO).",
        },
        {
          milestone: 2020,
          description: "Разработка и быстрое распространение вакцин против COVID-19."
        },
        {
          milestone: 2021,
          description: "Успешное завершение миссии NASA \"Персеверанс\" на Марсе, которая начала искать признаки древней жизни."
        },
        {
          milestone: 2022,
          description: "Объявление о создании первого в мире квантового компьютера, способного выполнять сложные вычисления."
        }
      ]
    },
    {
      periodStart: 2006,
      periodEnd: 2012,
      periodName: "Автомобили",
      events: [
        {
          milestone: 2006,
          description: "Премьера первого серийного автомобиля с гибридной системой привода Toyota Prius.",
        },
        {
          milestone: 2007,
          description: "Выпуск Tesla Roadster - первый серийный электрический авто от компании Tesla",
        },
        {
          milestone: 2008,
          description: "Премьера \"Ford Focus\" нового поколения, ставший одним из самых продаваемых автомобилей в мире.",
        },
        {
          milestone: 2009,
          description: "Запуск программы \"Hyundai Assurance\", позволяющая покупателям вернуть свои автомобили, если они потеряли работу."
        },
        {
          milestone: 2010,
          description: "Дебют \"Chevrolet Camaro\" нового поколения, который вернул популярность классическим американским спортивным автомобилям."
        },
        {
          milestone: 2011,
          description: "Запуск \"Toyota Prius v\", увеличенной версии популярного гибридного автомобиля."
        },
        {
          milestone: 2012,
          description: "ИжАвто прекратил выпуск LADA 2107. Последний авто сошел с конвейера 17 апреля."
        }
      ]
    },
    {
      periodStart: 2013,
      periodEnd: 2018,
      periodName: "Автомобили",
      events: [
        {
          milestone: 2013,
          description: "\"Бостонские Медведи\" выиграли Кубок Стэнли в НХЛ",
        },
        {
          milestone: 2014,
          description: "Проведение Чемпионата мира по футболу в Бразилии, где сборная Германии одержала победу, обыграв Аргентину",
        },
      ],
    }
  ]
}
